<a href="https://colab.research.google.com/github/ludawg44/jigsawlabs/blob/master/Copy_of_4_selecting_cols_lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Selecting Columns Lab

### Loading and Exploring the Data

Let's begin by loading our data into pandas and assigning it to the variable `high_school_df`.

In [0]:
import pandas as pd
high_school_df = pd.read_csv('https://raw.githubusercontent.com/jigsawlabs-student/introductory-pandas/master/nyc_hs_sat.csv')

Take a look at the columns that were loaded.

In [0]:
df_cols = high_school_df.columns
df_cols

df_cols
# Index(['Unnamed: 0', 'dbn', 'name', 'num_test_takers', 'reading_avg',
#        'math_avg', 'writing_score', 'boro', 'total_students',
#        'graduation_rate', 'attendance_rate', 'college_career_rate'],
#       dtype='object')

Index(['Unnamed: 0', 'dbn', 'name', 'num_test_takers', 'reading_avg',
       'math_avg', 'writing_score', 'boro', 'total_students',
       'graduation_rate', 'attendance_rate', 'college_career_rate'],
      dtype='object')

We can see some initial rows of data by applying the `slice` method, like we would in Python.

In [0]:
high_school_df[:3]

   Unnamed: 0     dbn  ... attendance_rate  college_career_rate
0           0  01M292  ...            0.87                 0.36
1           1  01M448  ...            0.93                 0.70
2           2  01M450  ...            0.94                 0.77

[3 rows x 12 columns]

Let's just select the `name` column, and assign it to the variable, `high_school_name`.

In [0]:
high_school_name = high_school_df['name']
high_school_name

0          HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1                    UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
2                             EAST SIDE COMMUNITY SCHOOL
3                                MARTA VALLE HIGH SCHOOL
4      NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...
                             ...
351          EBC HIGH SCHOOL FOR PUBLIC SERVICE–BUSHWICK
352                   BUSHWICK SCHOOL FOR SOCIAL JUSTICE
353                            ACADEMY OF URBAN PLANNING
354                 ALL CITY LEADERSHIP SECONDARY SCHOOL
355    BUSHWICK LEADERS HIGH SCHOOL FOR ACADEMIC EXCE...
Name: name, Length: 356, dtype: object

In [0]:
high_school_name[:2]

# 0    HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
# 1              UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
# Name: name, dtype: object

0    HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES
1              UNIVERSITY NEIGHBORHOOD HIGH SCHOOL
Name: name, dtype: object

Ok, now let's select the columns related mainly to the SAT score.  So let's select the `num_test_takers, reading_avg, math_avg,` `writing_score` columns.  Assign it to the variable `sat_df`.

In [0]:
cols = ['num_test_takers', 'reading_avg', 'math_avg', 'writing_score']
sat_df = high_school_df[cols]
sat_df

     num_test_takers  reading_avg  math_avg  writing_score
0               29.0        355.0     404.0          363.0
1               91.0        383.0     423.0          366.0
2               70.0        377.0     402.0          370.0
3               44.0        390.0     433.0          384.0
4              159.0        522.0     574.0          525.0
..               ...          ...       ...            ...
351             88.0        384.0     409.0          361.0
352             75.0        348.0     353.0          334.0
353             67.0        342.0     364.0          354.0
354             39.0        428.0     465.0          422.0
355             23.0        347.0     358.0          350.0

[356 rows x 4 columns]

In [0]:
sat_df[:3]

# 	reading_avg	math_avg	writing_score
# 0	355.0	404.0	363.0
# 1	383.0	423.0	366.0
# 2	377.0	402.0	370.0

   num_test_takers  reading_avg  math_avg  writing_score
0             29.0        355.0     404.0          363.0
1             91.0        383.0     423.0          366.0
2             70.0        377.0     402.0          370.0

### Working with the index column

The index column is currently a list of numbers.  But we can see that we have a columns of `dbn` that stands for `database_number`.  Let's change the index column to be the database number.

In [0]:
high_school_df.head()

   Unnamed: 0     dbn  ... attendance_rate  college_career_rate
0           0  01M292  ...            0.87                 0.36
1           1  01M448  ...            0.93                 0.70
2           2  01M450  ...            0.94                 0.77
3           3  01M509  ...            0.79                 0.49
4           4  01M539  ...            0.95                 0.85

[5 rows x 12 columns]

In [0]:
high_school_df.index = high_school_df['dbn']
high_school_df.head()

        Unnamed: 0     dbn  ... attendance_rate  college_career_rate
dbn                         ...
01M292           0  01M292  ...            0.87                 0.36
01M448           1  01M448  ...            0.93                 0.70
01M450           2  01M450  ...            0.94                 0.77
01M509           3  01M509  ...            0.79                 0.49
01M539           4  01M539  ...            0.95                 0.85

[5 rows x 12 columns]

If we look at our dataframe again, though, now we can see that we have the `dbn` information listed twice.

In [0]:
high_school_df[:3]

# if dbn is not listed twice, check your code about the index above

        Unnamed: 0     dbn  ... attendance_rate  college_career_rate
dbn                         ...
01M292           0  01M292  ...            0.87                 0.36
01M448           1  01M448  ...            0.93                 0.70
01M450           2  01M450  ...            0.94                 0.77

[3 rows x 12 columns]

Let's remove the column from the dataframe, and assign the new dataframe to be `hs_df`.

In [0]:
hs_df = high_school_df.drop(columns='dbn')
hs_df.head()

        Unnamed: 0  ... college_career_rate
dbn                 ...
01M292           0  ...                0.36
01M448           1  ...                0.70
01M450           2  ...                0.77
01M509           3  ...                0.49
01M539           4  ...                0.85

[5 rows x 11 columns]

In [0]:
hs_df = high_school_df.drop('Unnamed: 0', axis=1)
hs_df.head()

           dbn  ... college_career_rate
dbn             ...
01M292  01M292  ...                0.36
01M448  01M448  ...                0.70
01M450  01M450  ...                0.77
01M509  01M509  ...                0.49
01M539  01M539  ...                0.85

[5 rows x 11 columns]

In [0]:
'dbn' in hs_df.columns
# False

False

In [0]:
hs_df.head()

        Unnamed: 0  ... college_career_rate
dbn                 ...
01M292           0  ...                0.36
01M448           1  ...                0.70
01M450           2  ...                0.77
01M509           3  ...                0.49
01M539           4  ...                0.85

[5 rows x 11 columns]